Revit 2024 API
ParameterTypeId.SteelElemBoltDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemBoltDiameter { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemBoltDiameter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemBoltDiameter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace